# Importando Bibliotecas

In [1]:
import pandas as pd

# Puxando os Dados Principais

In [2]:
modalidade = pd.read_excel('dados/STG_MDL.xlsx')
pagamento = pd.read_excel('dados/STG_PGT.xlsx')
movimento = pd.read_excel('dados/STG_MVT_CRD.xlsx')
operacao = pd.read_excel('dados/STG_OPR_ITT.xlsx')
fonte = pd.read_excel('dados/STG_FNT_ITT.xlsx')

# Puxando os Dados Complementares

In [3]:
pessoa_fisica = pd.read_csv("dados/fatec_pessoa_fisica.csv", sep = '|', encoding='UTF-8', header = 1)

In [4]:
pessoa_fisica

,Unnamed: 0,id,cpf,idc_sexo,ano_dat_nascimento,Unnamed: 5
0,+-----------+--------------+----------+-------...,NaN,NaN,NaN,NaN,NaN
1,NaN,804129883,37311167211,M,2000,NaN
2,NaN,246036379,34115266395,M,1969,NaN
3,NaN,218979283,35622655491,M,1970,NaN
4,NaN,717277229,33222324480,F,1994,NaN
...,...,...,...,...,...,...
3005,NaN,271099619,223885940544,F,1962,NaN
3006,NaN,209547061,265864987976,F,1975,NaN
3007,NaN,97718872,262208637843,F,1983,NaN
3008,NaN,66330285,255487112307,F,1983,NaN
3009,+-----------+--------------+----------+-------...,NaN,NaN,NaN,NaN,NaN

## Limpando o DataFrame

Abaixo estamos definindo o nome da coluna bugada para ser usada na função a seguinte:

In [5]:
# Exemplo de como é a nomeclatura das colunas antes da alteração:

pessoa_fisica.columns[1:5]
pessoa_fisica_colunas = pessoa_fisica.columns[1:5]

In [6]:
# Estamos armazenando um exemplo do nome da coluna, para no código a seguir retirarmos a quebra de página:

coluna = pessoa_fisica.columns[1]

In [7]:
# Demonstração da váriavel: 

coluna

' id        '

## Redefinindo as colunas das tabelas

In [8]:
pessoa_fisica = pd.DataFrame(pessoa_fisica, columns = pessoa_fisica_colunas)

In [9]:
pessoa_fisica

       id           cpf             idc_sexo    ano_dat_nascimento
0             NaN             NaN         NaN                   NaN
1      804129883    37311167211     M           2000
2      246036379    34115266395     M           1969
3      218979283    35622655491     M           1970
4      717277229    33222324480     F           1994
...           ...             ...         ...                   ...
3005   271099619    223885940544    F           1962
3006   209547061    265864987976    F           1975
3007   97718872     262208637843    F           1983
3008   66330285     255487112307    F           1983
3009          NaN             NaN         NaN                   NaN

[3010 rows x 4 columns]

## Redefinindo os nomes das colunas

In [10]:
# Definindo os novos nomes das colunas:
pessoa_fisica.columns = ['id', 'cpf', 'idc_sexo', 'ano_dat_nascimento']

In [11]:
# Nomeclatura das colunas depois da alteração:
pessoa_fisica.columns

Index(['id', 'cpf', 'idc_sexo', 'ano_dat_nascimento'], dtype='object')

## Retirando os valores nulos

In [12]:
# Exemplo da tabela antes de retirar os valores nulos entre as quebras de página:
pessoa_fisica


# Como você pode observar na tabela abaixo, existe linhas entre as quebras de página, que possuem valores nulos

               id             cpf    idc_sexo    ano_dat_nascimento
0             NaN             NaN         NaN                   NaN
1      804129883    37311167211     M           2000
2      246036379    34115266395     M           1969
3      218979283    35622655491     M           1970
4      717277229    33222324480     F           1994
...           ...             ...         ...                   ...
3005   271099619    223885940544    F           1962
3006   209547061    265864987976    F           1975
3007   97718872     262208637843    F           1983
3008   66330285     255487112307    F           1983
3009          NaN             NaN         NaN                   NaN

[3010 rows x 4 columns]

In [13]:
# Retirando os valores nulos entre as quebras de página:

pessoa_fisica = pessoa_fisica[(pd.isna(pessoa_fisica['id']) != True)]

## Retirando as quebras de pagina no DataFrame

In [14]:
# Usando a váriavel anterior para retirar as quebrar de página:

pessoa_fisica[(pessoa_fisica['cpf'] != coluna)]

               id             cpf    idc_sexo    ano_dat_nascimento
1      804129883    37311167211     M           2000
2      246036379    34115266395     M           1969
3      218979283    35622655491     M           1970
4      717277229    33222324480     F           1994
5      3674219      1505546115      M           1971
...           ...             ...         ...                   ...
3004   123479485    255051104931    M           1983
3005   271099619    223885940544    F           1962
3006   209547061    265864987976    F           1975
3007   97718872     262208637843    F           1983
3008   66330285     255487112307    F           1983

[3002 rows x 4 columns]

In [15]:
pessoa_fisica.count()

id                    3002
cpf                   3002
idc_sexo              3002
ano_dat_nascimento    3002
dtype: int64

In [16]:
pessoa_fisica.shape

(3002, 4)